{"news":[{"title":"Пост","text":"Пост","status":"confirmed","author":"Прошичев Александр","author_id":"0","news_id":"0"},{"title":"Построили рыбу B)","text":"Хочу поделиться своим первым и удачным опытом участия в международных конкурсах. Таким конкурсом стал Американский конкурс математического моделирования на основе дифференциальных уравнений SCUDEM. Моя команда в составе Елены Найдёновой и Егора Шушкова выбрала проблему моделирования механики движения челюстей рыбы во время кормления всасыванием. С ребятами мы составили модель, перерыв кучу иноязычных статей, постарались в наибольшей мере передать материал на Английском языке и сняли для записи видео крутую (по моему мнению) университетскую студию самозаписи. В итоге наша команда получила высшую награду конкурса Outstanding Award! Я очень благодарен своим коллегам за такую классную работу! 🧡🧡🧡 Решение данной задачи отличалось от обычных заданий в школе/вузе, потому что улучшать и менять модель можно было бесконечно много. И никто из нас или организаторов не знал, к чему это приведёт. Почти научная работа :)\nhttps://www.youtube.com/watch?v=qROUaQuBEyU","status":"confirmed","author":"Прошичев Александр","author_id":"0","news_id":"1"},{"title":"Мой первый танцевальный батл","text":"Я вот тут недавно сгонял на танцевальный батл. Столько крутых танцоров в одном месте я ещё не видел! Всё это так было неожиданно и приятно. Тёплые овации зрителей, слишком крутая поддержка команды. Это мой первый опыт, который хочется оставить здесь. Если ваша туса не похожа на эту, то... я всё равно приду!🥶🗿","status":"confirmed","author":"Прошичев Александр","author_id":"0","news_id":"2"},{"title":"Батл общаг","text":"Вчера, 15 Апреля, прошёл долгожданный танцевальный конкурс общаг. Это было балдёжно! Впервые я себя попробовал в роли хореографа. Я так горжусь ребятами из своей команды!!! Каждый из них выложился настолько, что зрителей снесло волной энергии. Незабываемый и очень ценный опыт!🧡\nСеребро🥈","status":"confirmed","author":"Прошичев Александр","author_id":"0","news_id":"3"}]}