import requests as req
import json
import random as rd
import re
from airflow.providers.amazon.aws.hooks.s3 import S3Hook
import pickle

class FakeReviews():

    def __init__(self):
        s3_hook = S3Hook("my_conn_S3")
        pickle_production_obj = s3_hook.download_file(key="data/products.pkl", bucket_name="fake-reviews")

        with open(pickle_production_obj, "rb") as prod:
            self.products = pickle.load(prod)

        self.ids = []
            
        self.emotion = ['негативный', "позитивный", "нейтральный"]

        self.sizes = ['очень маленький', 'маленький'] + ['10 слов'] * 50
        
        self.costumers = [
        "Домохозяйка, 30 лет, заботливая, флегматик", 
        "Студент, 20 лет, любознательный, холерик", 
        "Инженер, 40 лет, ответственный, сангвиник", 
        "Предприниматель, 35 лет, решительный, сангвиник", 
        "Неизвестна, 50 лет, добрая, меланхолик", 
        "Врач, 33 года, внимательный, сангвиник", 
        "Учитель, 45 лет, терпеливый, флегматик", 
        "Дизайнер, 28 лет, креативный, холерик", 
        "Продавец, 25 лет, общительный, сангвиник", 
        "Строитель, 38 лет, трудолюбивый, флегматик", 
        "Менеджер, 42 года, организованный, сангвиник", 
        "Спортсмен, 32 года, целеустремленный, холерик", 
        "Пенсионер, 65 лет, мудрый, флегматик", 
        "Безработный, 37 лет, веселый, сангвиник", 
        "Неизвестна, 27 лет, дружелюбная, холерик",
        "Продавец, 30 лет, ответственный, флегматик", 
        "Домохозяйка, 45 лет, заботливая, сангвиник", 
        "Студент, 20 лет, любознательный, холерик", 
        "Строитель, 35 лет, трудолюбивый, сангвиник", 
        "Водитель, 50 лет, опытный, флегматик", 
        "Не известна, 27 лет, добрая, меланхолик", 
        "Менеджер, 33 года, коммуникабельный, сангвиник", 
        "Пенсионер, 65 лет, мудрый, флегматик", 
        "Программист, 25 лет, креативный, холерик", 
        "Врач, 40 лет, внимательный, сангвиник", 
        "Бухгалтер, 42 года, организованный, флегматик", 
        "Учитель, 37 лет, терпеливый, флегматик", 
        "Спортсмен, 23 года, активный, сангвиник", 
        "Дизайнер, 31 год, творческий, холерик", 
        "Предприниматель, 47 лет, решительный, сангвиник"
        ]
        
        self.dest = ["себе",
        "себе",
        "себе",
        "себе",
        "себе",
        "себе",
        "себе",
        "себе",
        "себе",
        "себе",
        "себе",
        "себе",
        "жене",
        "мужу",
        "сыну",
        "дочке",
        "брату",
        "сестре",
        "коллеге",
        "соседу",
        "другу",
        "подруге",
        "матери",
        "отцу",
        "тёще",
        "свёкру",
        "свекрови",
        "однокласснику",
        "приятелю",
        "учительнице",
        "тренеру",
        "психотерапевту",
        "лечащему врачу"
        ]

    def get_reviews(self, count : int):
        self.ids = [0] * count

        for idx in range(count):
            prompt = {

            "modelUri": "gpt://**код**/yandexgpt-lite",
            "completionOptions":
            {
                "stream": False,
                "temperature": 0.6,
                "maxTokens": "2000"
            },
            "messages":[
                {
                    "role": "system",
                    "text": "Представь, что ты " + self.costumers[rd.randint(0, 29)] + ". Напиши один " + self.emotion[rd.randint(0, 2)] + " " + self.sizes[rd.randint(0, len(self.sizes) - 1)] + " отзыв на товар: " + self.products[rd.randint(0, 203)] + ". Нельзя использовать следующие слова ['заявленному', 'маска', 'набор', 'рюкзак', 'покрывало', 'оказался', 'подошёл', 'доволен', 'кроссовки', 'ожиданий', 'эту', 'книга', 'наушники', 'дорого', 'приве', 'неудобная', 'неудобно', '—', 'куртка-рубашка', 'купил'].Ты покупаешь это для" + self.dest[rd.randint(0, 32)] +". Проверяй логичность отзыва. Ответ дай в виде json-файла. "
                },
                {
                    "role": "user",
                    "text": "Пример вывода: Пример json-файла: { 'отзыв': 'Отличное качество. Размер соответствует. Цвет приятный.' }"
                }
                ]
            }

            url = "https://llm.api.cloud.yandex.net/foundationModels/v1/completionAsync"
            headers = {
                "Content-Type": "application/json",
                "Authorization": "Api-Key **код**"

            }
    
            response = req.post(url, headers=headers, json=prompt)
            print(idx + 1)
            self.ids[idx] = json.loads(response.text)['id']
        s3_hook = S3Hook("my_conn_S3")
        pickle_ids_obj = pickle.dumps(self.ids)
        s3_hook.load_bytes(pickle_ids_obj, "data/ids2.pkl", bucket_name="fake-reviews", replace=True)

